## ndim - returns the number of dimensions of the data structure

In [1]:
import pandas as pd
import numpy as np
df = pd.Series(np.arange(1,101)) # Series of numbers from 1 to 100
print(df.ndim)

1

In [3]:
# create a list of dictionaries
data = [{'name': 'Saurav', 'age': 34, 'gender': 'M'},
        {'name': 'Saskia', 'age': 30, 'gender': 'F'},
        {'name': 'Nathan', 'age': 35, 'gender': 'M'},
        {'name': 'Wilhem', 'age': 40, 'gender': 'M'}]
df = pd.DataFrame(data) # Created a dataframe from the above data
print(df.ndim)

2

## axes :- returns a list of axes of the row labels

In [4]:
df = pd.Series(np.arange(1,101)) # Series of numbers from 1 to 100
print(df.axes)

[RangeIndex(start=0, stop=100, step=1)]

In [5]:
data = [{'name': 'Saurav', 'age': 34, 'gender': 'M'},
        {'name': 'Saskia', 'age': 30, 'gender': 'F'},
        {'name': 'Nathan', 'age': 35, 'gender': 'M'},
        {'name': 'Wilhem', 'age': 40, 'gender': 'M'}]
df = pd.DataFrame(data) # Created a dataframe from the above data
print(df.axes)

[RangeIndex(start=0, stop=4, step=1), Index(['name', 'age', 'gender'], dtype='object')]

## values :- method is used to return the underlying data as a NumPy array.

In [6]:
df = pd.Series(np.arange(1,101)) # Series of numbers from 1 to 100
print(df.values)

[  1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17  18
  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35  36
  37  38  39  40  41  42  43  44  45  46  47  48  49  50  51  52  53  54
  55  56  57  58  59  60  61  62  63  64  65  66  67  68  69  70  71  72
  73  74  75  76  77  78  79  80  81  82  83  84  85  86  87  88  89  90
  91  92  93  94  95  96  97  98  99 100]

In [7]:
data = [{'name': 'Saurav', 'age': 34, 'gender': 'M'},
        {'name': 'Saskia', 'age': 30, 'gender': 'F'},
        {'name': 'Nathan', 'age': 35, 'gender': 'M'},
        {'name': 'Wilhem', 'age': 40, 'gender': 'M'}]
df = pd.DataFrame(data) # Created a dataframe from the above data
print(df.values)

[['Saurav' 34 'M']
 ['Saskia' 30 'F']
 ['Nathan' 35 'M']
 ['Wilhem' 40 'M']]

## head() :- returns the first n rows of the data structure.

In [10]:
data = [{'name': 'Saurav', 'age': 34, 'gender': 'M'},
        {'name': 'Saskia', 'age': 30, 'gender': 'F'},
        {'name': 'Nathan', 'age': 35, 'gender': 'M'},
        {'name': 'Wilhem', 'age': 40, 'gender': 'M'},
        {'name': 'Juan', 'age': 32, 'gender': 'M'}]
df = pd.DataFrame(data) # Created a dataframe from the above data

In [11]:
df.head(6) # First 6 rows of the dataframe

     name  age gender
0  Saurav   34      M
1  Saskia   30      F
2  Nathan   35      M
3  Wilhem   40      M
4    Juan   32      M

In [9]:
df.head() # By default it takes the first 5 values of the dataframe

     name  age gender
0  Saurav   34      M
1  Saskia   30      F
2  Nathan   35      M
3  Wilhem   40      M

## tail() :- returns the last n rows of the data structure.

In [12]:
df.tail(3) # Last 3 rows of the dataframe

     name  age gender
2  Nathan   35      M
3  Wilhem   40      M
4    Juan   32      M

In [13]:
df.tail() # By default it takes the last 5 values of the dataframe

     name  age gender
0  Saurav   34      M
1  Saskia   30      F
2  Nathan   35      M
3  Wilhem   40      M
4    Juan   32      M

## sum() :- returns the sum of the values for the requested axis

In [15]:
dict = {'even':np.arange(0,80,2),'odd':np.arange(1,80,2)}
df = pd.DataFrame(dict)
print(df.sum())

even    1560
odd     1600
dtype: int64

## std() :- returns the sum of the values for the requested axis

In [16]:
dict = {'even':np.arange(0,80,2),'odd':np.arange(1,80,2)}
df = pd.DataFrame(dict)
print(df.std())

even    23.380904
odd     23.380904
dtype: float64

## iteritems() :- iterates over each column as key , value pair

In [20]:
df = pd.DataFrame(np.random.randn(5,4),columns =['col1','col2','col3','col4'])
for key, value in df.iteritems():
    print(key,value)

col1 0    0.495072
1    1.405290
2   -1.098552
3   -1.067371
4   -0.185172
Name: col1, dtype: float64
col2 0    1.744520
1    0.720599
2   -1.027222
3   -0.353158
4    0.865414
Name: col2, dtype: float64
col3 0    0.427598
1    0.270351
2   -0.910122
3    0.786164
4   -0.203333
Name: col3, dtype: float64
col4 0    2.870959
1   -0.212712
2    1.656304
3   -0.556486
4   -0.209941
Name: col4, dtype: float64

## iterrows() :- iterates over each row as key , value pair

In [21]:
df = pd.DataFrame(np.random.randn(5,4),columns =['col1','col2','col3','col4'])
for key, value in df.iterrows():
    print(key,value)

0 col1    1.017112
col2   -0.589057
col3   -0.057863
col4   -1.143442
Name: 0, dtype: float64
1 col1   -0.141282
col2   -1.348176
col3    0.136692
col4    1.244112
Name: 1, dtype: float64
2 col1   -0.952119
col2   -0.476144
col3    0.043419
col4    1.844344
Name: 2, dtype: float64
3 col1    1.523378
col2    0.469539
col3   -0.328933
col4   -0.801694
Name: 3, dtype: float64
4 col1   -0.250913
col2   -0.147526
col3    1.259217
col4   -0.514633
Name: 4, dtype: float64

## itertuples() :- returns an iterator yielding a named tuple for each row

In [24]:
df = pd.DataFrame(np.random.randn(5,4),columns =['col1','col2','col3','col4'])
for row in df.itertuples():
    print(row)

Pandas(Index=0, col1=-0.8652037298004097, col2=-1.1670715004361842, col3=-1.0309404552265158, col4=0.3869256803394107)
Pandas(Index=1, col1=-1.3634836846346057, col2=-1.2845064434461704, col3=0.874714915293336, col4=-0.1407968626124412)
Pandas(Index=2, col1=-0.7862834328110341, col2=-0.2724967668400483, col3=0.377653138798545, col4=0.9260890306042409)
Pandas(Index=3, col1=-0.27194140555964375, col2=-0.4585942116423214, col3=0.3541619427166816, col4=-0.528281486621773)
Pandas(Index=4, col1=-0.5489074400972448, col2=0.3257079017164795, col3=0.16563616646916843, col4=-0.22756759399366155)

## GroupBy Operations 

The GroupBy method is used for the purpose of grouping the rows of a dataframe based on the values of one or more column.  The groupby method returns a GroupBy object, which can be used to apply various aggregation and transformation functions to the grouped data.

In [25]:
champions = {"Team":["RCB","MTR","DC","GL","SH","LG","RCB","CSK","RR","KKR","SF"],"Rank":[7,8,6,2,9,3,7,1,4,5,10],
             "Year":[2010,2008,2012,2017,2019,2014,2016,2018,2009,2010,2013]}
df = pd.DataFrame(champions)
print(df.groupby("Team").groups)

{'CSK': [7], 'DC': [2], 'GL': [3], 'KKR': [9], 'LG': [5], 'MTR': [1], 'RCB': [0, 6], 'RR': [8], 'SF': [10], 'SH': [4]}

In [27]:
# We can also iterate through it
grouped = df.groupby("Team")
for name,group in grouped:
    print(name)

CSK
DC
GL
KKR
LG
MTR
RCB
RR
SF
SH

In [28]:
# We can select a particluar group by using the get_group() method
print(grouped.get_group("RCB"))

  Team  Rank  Year
0  RCB     7  2010
6  RCB     7  2016

## Aggregations 

An aggregation function returns a single aggregated values for each group

In [32]:
data = {'name': ['Saurav', 'Saskia', 'Vincent', 'David', 'Paula', 'Frank'],
        'age': [25, 30, 35, 40, 35, 30],
        'gender': ['M', 'F', 'M', 'M', 'F', 'M'],
        'salary': [50000, 60000, 70000, 80000, 75000, 55000] }
df = pd.DataFrame(data)
grouped = df.groupby("gender")
agg_data = grouped.agg({'salary': ['mean', 'sum']})
agg_data

         salary
           mean     sum
gender
F       67500.0  135000
M       63750.0  255000

## Concatenation :- The process of combining two or more data strucuture into a single datastructure. concat() method is used for this purpose.

In [33]:
champions = {"Team":["GL","SH","CSK","RR","KKR"],"Rank":[1,8,6,2,4],
             "Year":[2010,2009,2013,2017,2022],
            "Points":[897,789,765,987,971]}
champions_df = pd.DataFrame(champions)

In [35]:
chokers = {"Team":["RCB","DC","LSG"],"Rank":[3,5,7],
            "Points":[387,489,560]}
chokers_df = pd.DataFrame(chokers)

In [37]:
print(pd.concat([champions_df,chokers_df]))

  Team  Rank    Year  Points
0   GL     1  2010.0     897
1   SH     8  2009.0     789
2  CSK     6  2013.0     765
3   RR     2  2017.0     987
4  KKR     4  2022.0     971
0  RCB     3     NaN     387
1   DC     5     NaN     489
2  LSG     7     NaN     560

In [38]:
print(champions_df.append(chokers_df))

  Team  Rank    Year  Points
0   GL     1  2010.0     897
1   SH     8  2009.0     789
2  CSK     6  2013.0     765
3   RR     2  2017.0     987
4  KKR     4  2022.0     971
0  RCB     3     NaN     387
1   DC     5     NaN     489
2  LSG     7     NaN     560

C:\Users\saurava\AppData\Local\Temp\ipykernel_17104\885231025.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  print(champions_df.append(chokers_df))

In [41]:
# axis =1 means that the concatenation will be done horizontally 
print(pd.concat([champions_df,chokers_df],axis=1))

  Team  Rank  Year  Points Team  Rank  Points
0   GL     1  2010     897  RCB   3.0   387.0
1   SH     8  2009     789   DC   5.0   489.0
2  CSK     6  2013     765  LSG   7.0   560.0
3   RR     2  2017     987  NaN   NaN     NaN
4  KKR     4  2022     971  NaN   NaN     NaN

## Merging and Joining 

Merging is the pandas operation that perform the join operations on objects

In [54]:
champions = {"Team":["GL","SH","CSK","RR","KKR"],"Rank":[1,8,6,2,4],
             "Year":[2010,2009,2013,2017,2022],
            "Points":[897,789,765,987,971]}
champions_df = pd.DataFrame(champions)
match_stats = {"Team":["GL","SH","CSK","RR","KKR"],
               "tournament_played":[11,10,9,12,5],"matches_played":[210,150,165,135,216]}
match_stats_df = pd.DataFrame(match_stats)

In [47]:
# Merging on the common column 

print(pd.merge(champions_df,match_stats_df,on="Team"))

  Team  Rank  Year  Points  tournament_played  matches_played
0   GL     1  2010     897                 11             210
1   SH     8  2009     789                 10             150
2  CSK     6  2013     765                  9             165
3   RR     2  2017     987                 12             135
4  KKR     4  2022     971                  5             216

In [50]:
# Left Join
champions = {"Team":["GL","SH","CSK","RR","KKR"],"Rank":[1,8,6,2,4],
             "Year":[2010,2009,2013,2017,2022],
            "Points":[897,789,765,987,971]}
champions_df = pd.DataFrame(champions)

chokers = {"Team":["RCB","DC","LSG"],"Rank":[3,5,7],
            "Points":[387,489,560]}
chokers_df = pd.DataFrame(chokers)
print(pd.merge(champions_df,chokers_df,on="Team",how="left"))

  Team  Rank_x  Year  Points_x  Rank_y  Points_y
0   GL       1  2010       897     NaN       NaN
1   SH       8  2009       789     NaN       NaN
2  CSK       6  2013       765     NaN       NaN
3   RR       2  2017       987     NaN       NaN
4  KKR       4  2022       971     NaN       NaN

In [51]:
# Right join 
champions = {"Team":["GL","SH","CSK","RR","KKR"],"Rank":[1,8,6,2,4],
             "Year":[2010,2009,2013,2017,2022],
            "Points":[897,789,765,987,971]}
champions_df = pd.DataFrame(champions)

chokers = {"Team":["RCB","DC","LSG"],"Rank":[3,5,7],
            "Points":[387,489,560]}
chokers_df = pd.DataFrame(chokers)
print(pd.merge(champions_df,chokers_df,on="Team",how="right"))

  Team  Rank_x  Year  Points_x  Rank_y  Points_y
0  RCB     NaN   NaN       NaN       3       387
1   DC     NaN   NaN       NaN       5       489
2  LSG     NaN   NaN       NaN       7       560

In [52]:
# Outer Join

champions = {"Team":["GL","SH","CSK","RR","KKR"],"Rank":[1,8,6,2,4],
             "Year":[2010,2009,2013,2017,2022],
            "Points":[897,789,765,987,971]}
champions_df = pd.DataFrame(champions)

chokers = {"Team":["RCB","DC","LSG"],"Rank":[3,5,7],
            "Points":[387,489,560]}
chokers_df = pd.DataFrame(chokers)
print(pd.merge(champions_df,chokers_df,on="Team",how="outer"))

  Team  Rank_x    Year  Points_x  Rank_y  Points_y
0   GL     1.0  2010.0     897.0     NaN       NaN
1   SH     8.0  2009.0     789.0     NaN       NaN
2  CSK     6.0  2013.0     765.0     NaN       NaN
3   RR     2.0  2017.0     987.0     NaN       NaN
4  KKR     4.0  2022.0     971.0     NaN       NaN
5  RCB     NaN     NaN       NaN     3.0     387.0
6   DC     NaN     NaN       NaN     5.0     489.0
7  LSG     NaN     NaN       NaN     7.0     560.0

In [53]:
# Inner join
champions = {"Team":["GL","SH","CSK","RR","KKR"],"Rank":[1,8,6,2,4],
             "Year":[2010,2009,2013,2017,2022],
            "Points":[897,789,765,987,971]}
champions_df = pd.DataFrame(champions)

chokers = {"Team":["RCB","DC","LSG"],"Rank":[3,5,7],
            "Points":[387,489,560]}
chokers_df = pd.DataFrame(chokers)
print(pd.merge(champions_df,chokers_df,on="Team",how="inner"))

Empty DataFrame
Columns: [Team, Rank_x, Year, Points_x, Rank_y, Points_y]
Index: []